import React from "react";

function Structure() {
  return (
    <div className="container text-center py-5">
      <h1 className="fw-bold text-primary">ساختار مغز</h1>
      <p>دارد. این اندام از مجموعه نورون‌ها و سلول‌های گلیا تشکیل شده است که بخش‌های مختلف مغز را می‌سازند. این بخش‌ها با هماهنگی هم، دریافت پیام و ارسال پاسخ به اندام‌های محیطی فعالیت‌های مختلف بدن از بلند کردن یک مداد برای نوشتن متن تا حل یک مسئله پیچیده ریاضی را کنترل می‌کنند. به طور کلی سازمان‌یافتگی نورون‌های دستگاه عصبی مرکزی (مغز و نخاع) به شکلی است که دو ناحیه سفید و خاکستری در این اندام‌ها ایجاد می‌شود. ماده سفید مغز از رشته‌های عصبی میلین‌دار و ماده خاکستری از جسم سلولی، دندریت‌ها، پایانه آکسون و آکسون‌های کوتاه بدون میلین نورون‌ها تشکیل شده است. ماده خاکستری قشر مخ، قشر مخچه و هسته‌های داخلی مغز را می‌سازد
         و ماده سفید رابط بین بخش‌های مختلف با هم و نخاع است.</p>
      <img
        src="/Brain-Components.jpg"
        alt="ساختار مغز"
        className="img-fluid rounded shadow-lg mt-4"
        width="400px"
      />
    </div>
  );
}

export default Structure;
